Revit 2024 API
StickElementProjectionY Enumeration
 Presets for given Analytical Projection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum StickElementProjectionY
Visual Basic
<ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")> _
Public Enumeration StickElementProjectionY
Visual C++
[ObsoleteAttribute(L"This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum class StickElementProjectionY
Members
Member name | Description
LocationLine |  Location Line.
Left |  Horizontally, corresponds to left side of physical model.
Center |  Horizontally, center of physical model.
Right |  Horizontally, corresponds to right side of physical model.
Plane |  Use a Plane for projection (e.g., Grid, Level).
Varies |  Projection types are different at each end.
See Also
Autodesk.Revit.DB.Structure Namespace